In [34]:
import pandas as pd

In [35]:
pd.set_option('display.unicode.east_asian_width', True)

In [36]:
exam_data = {'이름':['경석', '연주', '선희'],
            '수학':[90, 85, 70],
            '영어':[98, 88, 95],
            '음악':[85, 79, 78],
            '체육':[80, 79, 75]}
df = pd.DataFrame(exam_data)
df.set_index('이름', inplace=True)
print(df)

      수학  영어  음악  체육
이름
경석    90    98    85    80
연주    85    88    79    79
선희    70    95    78    75

In [37]:
print(df.shape)

(3, 4)

In [38]:
df.iloc[0,3] = 90
print(df)

      수학  영어  음악  체육
이름
경석    90    98    85    90
연주    85    88    79    79
선희    70    95    78    75

In [39]:
df.loc['경석', '체육'] = 110
print(df)

      수학  영어  음악  체육
이름
경석    90    98    85   110
연주    85    88    79    79
선희    70    95    78    75

In [40]:
df.loc['경석', ['체육', '음악']] = 120, 130
print(df)

      수학  영어  음악  체육
이름
경석    90    98   130   120
연주    85    88    79    79
선희    70    95    78    75

In [41]:
df = df.transpose()
print(df)

이름  경석  연주  선희
수학    90    85    70
영어    98    88    95
음악   130    79    78
체육   120    79    75

In [42]:
df = df.T
print(df)

      수학  영어  음악  체육
이름
경석    90    98   130   120
연주    85    88    79    79
선희    70    95    78    75

In [43]:
df.loc['경석', '영어'], df.loc['경석', '체육'] = df.loc['경석', '체육'], df.loc['경석', '영어']
print(df)

      수학  영어  음악  체육
이름
경석    90   120   130    98
연주    85    88    79    79
선희    70    95    78    75

In [44]:
df.loc['경석'] = [30, 40, 55, 60]
print(df)

      수학  영어  음악  체육
이름
경석    30    40    55    60
연주    85    88    79    79
선희    70    95    78    75

In [45]:
ndf1 = df.set_index('음악')
print(ndf1)

      수학  영어  체육
음악
55      30    40    60
79      85    88    79
78      70    95    75

In [46]:
ndf2 = df.set_index(['수학', '영어'])
print(ndf2)

           음악  체육
수학 영어
30   40      55    60
85   88      79    79
70   95      78    75

In [47]:
ndf3 = df.reset_index()
print(ndf3)

   이름  수학  영어  음악  체육
0  경석    30    40    55    60
1  연주    85    88    79    79
2  선희    70    95    78    75

In [48]:
ndf3 = df.set_index(['음악'])
print(ndf3)

      수학  영어  체육
음악
55      30    40    60
79      85    88    79
78      70    95    75

In [49]:
ndf4 = df.reset_index().set_index(['음악'])
print(ndf4)

      이름  수학  영어  체육
음악
55    경석    30    40    60
79    연주    85    88    79
78    선희    70    95    75

In [16]:
print(df)
print(df.index)
df.index = ['옥호', '민자', '영숙']
#df.index = ['옥호', '민자', '영숙', '영림']
print(df)

      수학  영어  음악  체육
이름
경석    30    40    55    60
연주    85    88    79    79
선희    70    95    78    75
Index(['경석', '연주', '선희'], dtype='object', name='이름')
      수학  영어  음악  체육
옥호    30    40    55    60
민자    85    88    79    79
영숙    70    95    78    75

In [17]:
new_index = ['옥호', '민자', '영숙', '덕유', '영림']
ndf = df.reindex(new_index)
print(ndf)

      수학  영어  음악  체육
옥호  30.0  40.0  55.0  60.0
민자  85.0  88.0  79.0  79.0
영숙  70.0  95.0  78.0  75.0
덕유   NaN   NaN   NaN   NaN
영림   NaN   NaN   NaN   NaN

In [18]:
ndf = df.reindex(new_index, fill_value=0)
print(ndf)

      수학  영어  음악  체육
옥호    30    40    55    60
민자    85    88    79    79
영숙    70    95    78    75
덕유     0     0     0     0
영림     0     0     0     0

In [19]:
print(df)
ndf = df.sort_index()
print(ndf)

      수학  영어  음악  체육
옥호    30    40    55    60
민자    85    88    79    79
영숙    70    95    78    75
      수학  영어  음악  체육
민자    85    88    79    79
영숙    70    95    78    75
옥호    30    40    55    60

In [20]:
ndf = df.sort_index(ascending=False)
print(ndf)

      수학  영어  음악  체육
옥호    30    40    55    60
영숙    70    95    78    75
민자    85    88    79    79

In [21]:
ndf = df.sort_values(by='수학', ascending=False)
print(ndf)

      수학  영어  음악  체육
민자    85    88    79    79
영숙    70    95    78    75
옥호    30    40    55    60

In [22]:
student1 = pd.Series({'국어':100, '영어':80, '수학':90})
print(student1)

국어    100
영어     80
수학     90
dtype: int64

In [23]:
percentage = student1 / 100
print(percentage)
print(type(percentage))

국어    1.0
영어    0.8
수학    0.9
dtype: float64
<class 'pandas.core.series.Series'>

In [24]:
student2 = pd.Series({'영어':80, '국어':100, '수학':90})
print(student2)

영어     80
국어    100
수학     90
dtype: int64

In [25]:
print(student1)
print(student2)
addition = student1 + student2
subtraction = student1 - student2
multiplication = student1 * student2
division = student1 / student2
print(multiplication)
print(type(multiplication))
result = pd.DataFrame([addition, subtraction, multiplication, division],
        index=['addition', 'subtraction', 'mulltiplication', 'division'])
print(result)

국어    100
영어     80
수학     90
dtype: int64
영어     80
국어    100
수학     90
dtype: int64
국어    10000
수학     8100
영어     6400
dtype: int64
<class 'pandas.core.series.Series'>
                    국어    수학    영어
addition           200.0   180.0   160.0
subtraction          0.0     0.0     0.0
mulltiplication  10000.0  8100.0  6400.0
division             1.0     1.0     1.0

In [26]:
student2.drop('영어', inplace=True)
student1['국어'] = float('NaN')

In [27]:
print(student1)
print(student2)
addition = student1 + student2
subtraction = student1 - student2
multiplication = student1 * student2
division = student1 / student2
print(multiplication)
print(type(multiplication))
result = pd.DataFrame([addition, subtraction, multiplication, division],
        index=['addition', 'subtraction', 'mulltiplication', 'division'])
print(result)

국어     NaN
영어    80.0
수학    90.0
dtype: float64
국어    100
수학     90
dtype: int64
국어       NaN
수학    8100.0
영어       NaN
dtype: float64
<class 'pandas.core.series.Series'>
                 국어    수학  영어
addition          NaN   180.0   NaN
subtraction       NaN     0.0   NaN
mulltiplication   NaN  8100.0   NaN
division          NaN     1.0   NaN

In [28]:
print(student1)
print(student2)
addition = student1.add(student2, fill_value=0)
subtraction = student1.sub(student2, fill_value=0)
multiplication = student1.mul(student2, fill_value=1)
division = student1.div(student2, fill_value=1)
print(multiplication)
print(type(multiplication))
result = pd.DataFrame([addition, subtraction, multiplication, division],
        index=['addition', 'subtraction', 'mulltiplication', 'division'])
print(result)

국어     NaN
영어    80.0
수학    90.0
dtype: float64
국어    100
수학     90
dtype: int64
국어     100.0
수학    8100.0
영어      80.0
dtype: float64
<class 'pandas.core.series.Series'>
                   국어    수학  영어
addition         100.00   180.0  80.0
subtraction     -100.00     0.0  80.0
mulltiplication  100.00  8100.0  80.0
division           0.01     1.0  80.0

In [29]:
import seaborn as sns

In [30]:
titanic = sns.load_dataset('titanic')
print(type(titanic))
print(titanic)

<class 'pandas.core.frame.DataFrame'>
     survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0           0       3    male  22.0      1      0   7.2500        S   Third
1           1       1  female  38.0      1      0  71.2833        C   First
2           1       3  female  26.0      0      0   7.9250        S   Third
3           1       1  female  35.0      1      0  53.1000        S   First
4           0       3    male  35.0      0      0   8.0500        S   Third
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
886         0       2    male  27.0      0      0  13.0000        S  Second
887         1       1  female  19.0      0      0  30.0000        S   First
888         0       3  female   NaN      1      2  23.4500        S   Third
889         1       1    male  26.0      0      0  30.0000        C   First
890         0       3    male  32.0      0      0   7.7500        Q   Third

       who  adult_male deck  embark_town alive  alone
0      man        True  NaN  Southampton    no  False
1    woman       False    C    Cherbourg   yes  False
2    woman       False  NaN  Southampton   yes   True
3    woman       False    C  Southampton   yes  False
4      man        True  NaN  Southampton    no   True
..     ...         ...  ...          ...   ...    ...
886    man        True  NaN  Southampton    no   True
887  woman       False    B  Southampton   yes   True
888  woman       False  NaN  Southampton    no  False
889    man        True    C    Cherbourg   yes   True
890    man        True  NaN   Queenstown    no   True

[891 rows x 15 columns]

In [31]:
df = titanic.loc[:, ['age', 'fare']]
print(df.head())
print(type(df))

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500
<class 'pandas.core.frame.DataFrame'>

In [32]:
addition = df + 10
print(addition)

      age     fare
0    32.0  17.2500
1    48.0  81.2833
2    36.0  17.9250
3    45.0  63.1000
4    45.0  18.0500
..    ...      ...
886  37.0  23.0000
887  29.0  40.0000
888   NaN  33.4500
889  36.0  40.0000
890  42.0  17.7500

[891 rows x 2 columns]

In [33]:
subtraction = addition - df
print(subtraction)

      age  fare
0    10.0  10.0
1    10.0  10.0
2    10.0  10.0
3    10.0  10.0
4    10.0  10.0
..    ...   ...
886  10.0  10.0
887  10.0  10.0
888   NaN  10.0
889  10.0  10.0
890  10.0  10.0

[891 rows x 2 columns]